scripts/test/jmeter.log
2020-01-13 16:28:38,703 INFO o.a.j.u.JMeterUtils: Setting Locale to en_EN
2020-01-13 16:28:38,732 INFO o.a.j.JMeter: Loading user properties from: /Users/zong/Downloads/software/apache-jmeter-5.2.1/bin/user.properties
2020-01-13 16:28:38,733 INFO o.a.j.JMeter: Loading system properties from: /Users/zong/Downloads/software/apache-jmeter-5.2.1/bin/system.properties
2020-01-13 16:28:38,735 INFO o.a.j.JMeter: Copyright (c) 1998-2019 The Apache Software Foundation
2020-01-13 16:28:38,735 INFO o.a.j.JMeter: Version 5.2.1
2020-01-13 16:28:38,735 INFO o.a.j.JMeter: java.version=13.0.1
2020-01-13 16:28:38,735 INFO o.a.j.JMeter: java.vm.name=Java HotSpot(TM) 64-Bit Server VM
2020-01-13 16:28:38,735 INFO o.a.j.JMeter: os.name=Mac OS X
2020-01-13 16:28:38,735 INFO o.a.j.JMeter: os.arch=x86_64
2020-01-13 16:28:38,735 INFO o.a.j.JMeter: os.version=10.14.6
2020-01-13 16:28:38,735 INFO o.a.j.JMeter: file.encoding=UTF-8
2020-01-13 16:28:38,735 INFO o.a.j.JMeter: java.awt.headless=true
2020-01-13 16:28:38,735 INFO o.a.j.JMeter: Max memory     =1073741824
2020-01-13 16:28:38,735 INFO o.a.j.JMeter: Available Processors =8
2020-01-13 16:28:38,744 INFO o.a.j.JMeter: Default Locale=English (EN)
2020-01-13 16:28:38,744 INFO o.a.j.JMeter: JMeter  Locale=English (EN)
2020-01-13 16:28:38,744 INFO o.a.j.JMeter: JMeterHome=/Users/zong/Downloads/software/apache-jmeter-5.2.1
2020-01-13 16:28:38,744 INFO o.a.j.JMeter: user.dir  =/Users/zong/GitRepos/zongzw/efk-over-bigip/scripts/test
2020-01-13 16:28:38,744 INFO o.a.j.JMeter: PWD       =/Users/zong/GitRepos/zongzw/efk-over-bigip/scripts/test
2020-01-13 16:28:38,749 INFO o.a.j.JMeter: IP: 172.16.208.37 Name: BEI-ML-00005205 FullName: 172.16.208.37
2020-01-13 16:28:38,752 INFO o.a.j.JMeter: Setting property 'jmeter.reportgenerator.outputdir' to:'/Users/zong/GitRepos/zongzw/efk-over-bigip/scripts/test/test-report/send-2-fluentd-1578904117'
2020-01-13 16:28:38,755 INFO o.a.j.s.FileServer: Default base='/Users/zong/GitRepos/zongzw/efk-over-bigip/scripts/test'
2020-01-13 16:28:38,757 INFO o.a.j.s.FileServer: Set new base='/Users/zong/GitRepos/zongzw/efk-over-bigip/scripts/test'
2020-01-13 16:28:38,928 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2020-01-13 16:28:38,953 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2020-01-13 16:28:38,958 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2020-01-13 16:28:38,964 INFO o.a.j.s.SaveService: Loading file: send-2-fluentd.jmx
2020-01-13 16:28:39,084 INFO o.a.j.JMeter: Creating summariser <summary>
2020-01-13 16:28:39,100 INFO o.a.j.r.d.ReportGenerator: ReportGenerator will use for Parsing the separator: ','
2020-01-13 16:28:39,100 INFO o.a.j.r.d.ReportGenerator: Will generate report at end of test from  results file: test-report/result-1578904117.jtl
2020-01-13 16:28:39,100 INFO o.a.j.r.d.ReportGenerator: Reading report generator properties from: /Users/zong/Downloads/software/apache-jmeter-5.2.1/bin/reportgenerator.properties
2020-01-13 16:28:39,103 INFO o.a.j.r.d.ReportGenerator: Merging with JMeter properties
2020-01-13 16:28:39,113 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.temp_dir' not found, using default value 'temp' instead.
2020-01-13 16:28:39,117 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.apdex_per_transaction' not found, using default value 'null' instead.
2020-01-13 16:28:39,122 INFO o.a.j.r.c.ReportGeneratorConfiguration: apdex_per_transaction is empty, not APDEX per transaction customization
2020-01-13 16:28:39,122 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.sample_filter' not found, using default value 'null' instead.
2020-01-13 16:28:39,122 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.report_title' not found, using default value 'null' instead.
2020-01-13 16:28:39,123 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.start_date' not found, using default value 'null' instead.
2020-01-13 16:28:39,123 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.end_date' not found, using default value 'null' instead.
2020-01-13 16:28:39,123 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.date_format' not found, using default value 'null' instead.
2020-01-13 16:28:39,124 INFO o.a.j.r.c.ReportGeneratorConfiguration: Will use date range start date: null, end date: null
2020-01-13 16:28:39,130 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.totalTPS.exclude_controllers' not found, using default value 'false' instead.
2020-01-13 16:28:39,131 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.activeThreadsOverTime.exclude_controllers' not found, using default value 'false' instead.
2020-01-13 16:28:39,131 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.timeVsThreads.exclude_controllers' not found, using default value 'false' instead.
2020-01-13 16:28:39,131 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimeDistribution.exclude_controllers' not found, using default value 'false' instead.
2020-01-13 16:28:39,131 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.transactionsPerSecond.exclude_controllers' not found, using default value 'false' instead.
2020-01-13 16:28:39,131 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimePercentiles.exclude_controllers' not found, using default value 'false' instead.
2020-01-13 16:28:39,132 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimePercentilesOverTime.exclude_controllers' not found, using default value 'false' instead.
2020-01-13 16:28:39,132 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimesOverTime.exclude_controllers' not found, using default value 'false' instead.
2020-01-13 16:28:39,132 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.connectTimeOverTime.exclude_controllers' not found, using default value 'false' instead.
2020-01-13 16:28:39,133 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.latenciesOverTime.exclude_controllers' not found, using default value 'false' instead.
2020-01-13 16:28:39,134 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.json.filters_only_sample_series' not found, using default value 'true' instead.
2020-01-13 16:28:39,135 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.json.series_filter' not found, using default value '' instead.
2020-01-13 16:28:39,135 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.json.show_controllers_only' not found, using default value 'false' instead.
2020-01-13 16:28:39,135 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.html.filters_only_sample_series' not found, using default value 'true' instead.
2020-01-13 16:28:39,135 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.html.series_filter' not found, using default value '' instead.
2020-01-13 16:28:39,136 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.html.show_controllers_only' not found, using default value 'false' instead.
2020-01-13 16:28:39,146 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2020-01-13 16:28:39,154 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2020-01-13 16:28:39,154 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2020-01-13 16:28:39,170 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2020-01-13 16:28:39,170 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2020-01-13 16:28:39,711 INFO o.a.j.JMeter: Running test (1578904119711)
2020-01-13 16:28:39,763 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : localhost-20001
2020-01-13 16:28:39,764 INFO o.a.j.e.StandardJMeterEngine: Starting 1 threads for group localhost-20001.
2020-01-13 16:28:39,764 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2020-01-13 16:28:39,764 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=1 ramp-up=1 delayedStart=false
2020-01-13 16:28:39,772 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2020-01-13 16:28:39,773 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2020-01-13 16:28:39,779 INFO o.a.j.t.JMeterThread: Thread started: localhost-20001 1-1
2020-01-13 16:28:39,786 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2020-01-13 16:28:39,786 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to ISO-8859-1
2020-01-13 16:28:39,786 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2020-01-13 16:28:39,786 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2020-01-13 16:29:00,013 INFO o.a.j.r.Summariser: summary +  19625 in 00:00:20 =  967.3/s Avg:     0 Min:     0 Max:    27 Err:     0 (0.00%) Active: 1 Started: 1 Finished: 0
2020-01-13 16:29:30,007 INFO o.a.j.r.Summariser: summary +  29629 in 00:00:30 =  987.8/s Avg:     0 Min:     0 Max:     9 Err:     0 (0.00%) Active: 1 Started: 1 Finished: 0
2020-01-13 16:29:30,011 INFO o.a.j.r.Summariser: summary =  49254 in 00:00:50 =  979.4/s Avg:     0 Min:     0 Max:    27 Err:     0 (0.00%)
2020-01-13 16:30:00,001 INFO o.a.j.r.Summariser: summary +  29596 in 00:00:30 =  986.6/s Avg:     0 Min:     0 Max:     9 Err:     0 (0.00%) Active: 1 Started: 1 Finished: 0
2020-01-13 16:30:00,002 INFO o.a.j.r.Summariser: summary =  78850 in 00:01:20 =  982.1/s Avg:     0 Min:     0 Max:    27 Err:     0 (0.00%)
2020-01-13 16:30:30,009 INFO o.a.j.r.Summariser: summary +  29718 in 00:00:30 =  990.6/s Avg:     0 Min:     0 Max:     3 Err:     0 (0.00%) Active: 1 Started: 1 Finished: 0
2020-01-13 16:30:30,014 INFO o.a.j.r.Summariser: summary = 108568 in 00:01:50 =  984.4/s Avg:     0 Min:     0 Max:    27 Err:     0 (0.00%)
2020-01-13 16:31:00,001 INFO o.a.j.r.Summariser: summary +  29719 in 00:00:30 =  990.8/s Avg:     0 Min:     0 Max:     1 Err:     0 (0.00%) Active: 1 Started: 1 Finished: 0
2020-01-13 16:31:00,002 INFO o.a.j.r.Summariser: summary = 138287 in 00:02:20 =  985.7/s Avg:     0 Min:     0 Max:    27 Err:     0 (0.00%)
2020-01-13 16:31:30,010 INFO o.a.j.r.Summariser: summary +  29668 in 00:00:30 =  989.0/s Avg:     0 Min:     0 Max:     2 Err:     0 (0.00%) Active: 1 Started: 1 Finished: 0
2020-01-13 16:31:30,014 INFO o.a.j.r.Summariser: summary = 167955 in 00:02:50 =  986.3/s Avg:     0 Min:     0 Max:    27 Err:     0 (0.00%)
2020-01-13 16:32:00,008 INFO o.a.j.r.Summariser: summary +  29811 in 00:00:30 =  993.8/s Avg:     0 Min:     0 Max:     3 Err:     0 (0.00%) Active: 1 Started: 1 Finished: 0
2020-01-13 16:32:00,012 INFO o.a.j.r.Summariser: summary = 197766 in 00:03:20 =  987.4/s Avg:     0 Min:     0 Max:    27 Err:     0 (0.00%)
2020-01-13 16:32:30,008 INFO o.a.j.r.Summariser: summary +  29520 in 00:00:30 =  984.1/s Avg:     0 Min:     0 Max:     9 Err:     0 (0.00%) Active: 1 Started: 1 Finished: 0
2020-01-13 16:32:30,012 INFO o.a.j.r.Summariser: summary = 227286 in 00:03:50 =  986.9/s Avg:     0 Min:     0 Max:    27 Err:     0 (0.00%)
2020-01-13 16:33:00,001 INFO o.a.j.r.Summariser: summary +  29901 in 00:00:30 =  996.8/s Avg:     0 Min:     0 Max:     2 Err:     0 (0.00%) Active: 1 Started: 1 Finished: 0
2020-01-13 16:33:00,002 INFO o.a.j.r.Summariser: summary = 257187 in 00:04:20 =  988.1/s Avg:     0 Min:     0 Max:    27 Err:     0 (0.00%)
2020-01-13 16:33:30,002 INFO o.a.j.r.Summariser: summary +  29814 in 00:00:30 =  993.8/s Avg:     0 Min:     0 Max:     1 Err:     0 (0.00%) Active: 1 Started: 1 Finished: 0
2020-01-13 16:33:30,005 INFO o.a.j.r.Summariser: summary = 287001 in 00:04:50 =  988.7/s Avg:     0 Min:     0 Max:    27 Err:     0 (0.00%)
2020-01-13 16:34:00,009 INFO o.a.j.r.Summariser: summary +  29900 in 00:00:30 =  996.7/s Avg:     0 Min:     0 Max:     2 Err:     0 (0.00%) Active: 1 Started: 1 Finished: 0
2020-01-13 16:34:00,011 INFO o.a.j.r.Summariser: summary = 316901 in 00:05:20 =  989.4/s Avg:     0 Min:     0 Max:    27 Err:     0 (0.00%)
2020-01-13 16:34:30,016 INFO o.a.j.r.Summariser: summary +  29258 in 00:00:30 =  975.3/s Avg:     0 Min:     0 Max:     7 Err:     0 (0.00%) Active: 1 Started: 1 Finished: 0
2020-01-13 16:34:30,024 INFO o.a.j.r.Summariser: summary = 346159 in 00:05:50 =  988.2/s Avg:     0 Min:     0 Max:    27 Err:     0 (0.00%)
2020-01-13 16:34:58,898 INFO o.a.j.r.ResultCollector: Shutdown hook started
2020-01-13 16:34:58,919 INFO o.a.j.r.ResultCollector: Shutdown hook ended